/* Завдання - 3

Дано массив. Створіть на основі значень цього массиву два нових массиви.
В один массив помістіть всі парні значення, а у другий всі непарні.
Виведіть на екран значення, які війшли в перший массив та у другий массив. */

let massiv = [10, 20, 5, 7, 11, 8, 125, 4, 8, 3, 23];

// Створюємо два нових масиви для парних та непарних значень
let evenNumbers = [];
let oddNumbers = [];

// Перебираємо елементи масиву та розділяємо їх на парні та непарні
for (let number of massiv) {
    if (number % 2 === 0) {
        evenNumbers.push(number); //Додаємо парне число до масиву парних чисел
    } else {
        oddNumbers.push(number); //Додаємо непарне число до масиву непарних чисел
    }
}

//Додаємо лог для виводу парних і не парних чисел
console.log("Парні числа:", evenNumbers);
console.log("Непарні числа:", oddNumbers);